Тест/Тест/src/Catalogs/ВложенияВолжска/ВложенияВолжска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВложенияВолжска</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплаченоПоКредиту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсталосьОтбить</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусКредита</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Погашения</name>
    <attributes>
      <name>ДокументРасхода</name>
      <type>
        <types>DocumentRef.Расходы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест/Тест/src/Catalogs/ВложенияВолжска/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Сумма = ПосчитатьСумму();
КонецПроцедуры

&НаСервере
Функция ПосчитатьСумму()
	запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВложенияВолжска.Сумма) КАК Сумма
	               |ИЗ
	               |	Справочник.ВложенияВолжска КАК ВложенияВолжска";
	Возврат запрос.Выполнить().Выгрузить().Итог("Сумма");
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	Сумма = ПосчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Если Месяц > 0 И Год > 0 Тогда	
		ОбновитьИнфо();
	Иначе
		ОчиститьОтбор();
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	Если Месяц > 0 И Год > 0 Тогда	
		ОбновитьИнфо();
	Иначе
		ОчиститьОтбор();
	КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнфо()
	Дат1 = Дата(Год,Месяц,1);
	Дат2 = КонецМесяца(Дат1);
    Список.Отбор.Элементы.Очистить();

	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Дат1;
	
	ЭлементОтбора2 = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	ЭлементОтбора2.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ЭлементОтбора2.Использование = Истина;
	ЭлементОтбора2.ПравоеЗначение = Дат2;
КонецПроцедуры

&НаСервере
Процедура ОчиститьОтбор()
	Список.Отбор.Элементы.Очистить();
КонецПроцедуры


&НаКлиенте
Процедура Очистить(Команда)
	Месяц=0;
	Год=0;
	ОчиститьОтбор();
КонецПроцедуры
